---
kind: method
id: M:Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor
source: html/3af604c4-9144-43f3-51f0-db3730e9e5a3.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor Method

Constructs an AlphanumericRevisionSettings with a simple, default sequence.

## Syntax (C#)
```csharp
public AlphanumericRevisionSettings()
```

## Remarks
The default sequence contains each letter of the alphabet (may differ based on language settings).